[{"description":"Create a login screen as the landing page. The login form should have email and password fields with a 'Login' button. Use a clean, modern design with a centered login card.","type":"feature","passes":true,"id":1},{"description":"After successful login (use any credentials), redirect to a dashboard page. The dashboard should have a sidebar navigation on the left with links to 'Table' and 'Analytics' pages.","type":"feature","passes":true,"id":2},{"description":"On the Table page (default dashboard view), show a table where users can view items. Include an 'Add Item' button that opens a form/modal to add new items with fields like Name, Description, Price, and Quantity. Items should be stored and displayed in the table. Include edit and delete actions for each row.","type":"feature","passes":true,"id":3},{"description":"Create an Analytics page accessible from the sidebar. Display basic analytics derived from the items table data: total number of items, total value (sum of price * quantity), average price, highest priced item, and lowest priced item. Use cards or charts to visualize this data.","type":"feature","passes":true,"id":4},{"description":"Implement proper user authentication with a real database. Create a user registration page where new users can sign up with email and password. Store users in a database (SQLite or similar). Hash passwords securely. Add a 'Sign Up' link on the login page that goes to the registration form.","type":"feature","passes":true,"id":5},{"description":"Update the login system to authenticate against the real user database. Validate credentials properly and show error messages for invalid login attempts. Use sessions or JWT tokens to maintain login state.","type":"feature","passes":true,"id":6},{"description":"Store items in a real database linked to each user. Each user should only see their own items. When a user adds, edits, or deletes items, persist these changes to the database. Remove all fake/seed data - start with an empty table for new users.","type":"feature","passes":true,"id":7},{"description":"Update the Analytics page to calculate statistics from the user's actual database items instead of fake data. Show appropriate empty states when the user has no items yet.","type":"feature","passes":true,"id":8}]
